MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM375FSDMG/mcu.h
/**
  * @brief Vector Engine (VE)
  */
typedef struct
{
  __IO uint32_t EN;                /*!< VE enable/disable R/W                        */
  __O  uint32_t CPURUNTRG;         /*!< CPU start trigger selection W                */
  __IO uint32_t TASKAPP;           /*!< Task selection R/W                           */
  __IO uint32_t ACTSCH;            /*!< Operation schedule selection R/W             */
  __IO uint32_t REPTIME;           /*!< Schedule repeat count R/W                    */
  __IO uint32_t TRGMODE;           /*!< Start trigger mode R/W                       */
  __IO uint32_t ERRINTEN;          /*!< Error interrupt enable/disable R/W           */
  __O  uint32_t COMPEND;           /*!< VE forced termination W                      */
  __I  uint32_t ERRDET;            /*!< Error detection R                            */
  __I  uint32_t SCHTASKRUN;        /*!< Schedule executing flag/executing task R     */
       uint32_t RESERVED0;
  __IO uint32_t TMPREG0;           /*!< Temporary register R/W                       */
  __IO uint32_t TMPREG1;           /*!< Temporary register R/W                       */
  __IO uint32_t TMPREG2;           /*!< Temporary register R/W                       */
  __IO uint32_t TMPREG3;           /*!< Temporary register R/W                       */
  __IO uint32_t TMPREG4;           /*!< Temporary register R/W                       */
  __IO uint32_t TMPREG5;           /*!< Temporary register R/W                       */
       uint32_t RESERVED1[38];
  __IO uint32_t MCTLF1;            /*!< Status flags R/W                             */
  __IO uint32_t MODE1;             /*!< Task control mode R/W                        */
  __IO uint32_t FMODE1;            /*!< Flow control R/W                             */
  __IO uint32_t TPWM1;             /*!< 0PWM period rate (PWM period [s] * maximum speed*1 * 2^16) R/W*/
  __IO uint32_t OMEGA1;            /*!< Rotation speed (speed [Hz] / maximum speed *1*1 * 2^15) R/W*/
  __IO uint32_t THETA1;            /*!< Motor phase (motor phase [deg] / 360 * 2^16) R/W*/
  __IO uint32_t IDREF1;            /*!< d-axis reference value (current [A] / maximum current*2 * 2^15) R/W*/
  __IO uint32_t IQREF1;            /*!< q-axis reference value (current [A] / maximum current *2 * 2^15) R/W*/
  __IO uint32_t VD1;               /*!< d-axis voltage (voltage [V] / maximum voltage *3 * 2^31) R/W*/
  __IO uint32_t VQ1;               /*!< q-axis voltage (voltage [V] / maximum voltage *3 * 2^31) R/W*/
  __IO uint32_t CIDKI1;            /*!< Integral coefficient for PI control of d-axis R/W*/
  __IO uint32_t CIDKP1;            /*!< Proportional coefficient for PI control of d-axis R/W*/
  __IO uint32_t CIQKI1;            /*!< Integral coefficient for PI control of q-axis R/W*/
  __IO uint32_t CIQKP1;            /*!< Proportional coefficient for PI control of q-axis R/W*/
  __IO uint32_t VDIH1;             /*!< Upper 32 bits of integral term (VDI ) of d-axis voltage R/W*/
  __IO uint32_t VDILH1;            /*!< Lower 32 bits of integral term (VDI) of d-axis voltage R/W*/
  __IO uint32_t VQIH1;             /*!< Upper 32 bits of integral term (VQI) of q-axis voltage R/W*/
  __IO uint32_t VQILH1;            /*!< Lower 32 bits of integral term (VQI) of q-axis voltage R/W*/
  __IO uint32_t FPWMCHG1;          /*!< Switching speed (for 2-phase modulation and shift PWM) R/W*/
  __IO uint32_t MDPRD1;            /*!< PWM period (to be set identically with PMD's PWM period) R/W*/
  __IO uint32_t MINPLS1;           /*!< Minimum pulse width R/W                      */
  __IO uint32_t TRGCRC1;           /*!< Synchronizing trigger correction value R/W   */
       uint32_t RESERVED2;
  __IO uint32_t COS1;              /*!< Cosine value at THETA for output conversion (Q15 data) R/W*/
  __IO uint32_t SIN1;              /*!< Sine value at THETA for output conversion (Q15 data) R/W*/
  __IO uint32_t COSM1;             /*!< Previous cosine value for input processing (Q15 data) R/W*/
  __IO uint32_t SINM1;             /*!< Previous sine value for input processing (Q15 data) R/W*/
  __IO uint32_t SECTOR1;           /*!< Sector information (0-11) R/W                */
  __IO uint32_t SECTORM1;          /*!< Previous sector information for input processing (0-11) R/W*/
  __IO uint32_t IAO1;              /*!< AD conversion result of a-phase zero-current *4 R/W*/
  __IO uint32_t IBO1;              /*!< AD conversion result of b-phase zero-current *4 R/W*/
  __IO uint32_t ICO1;              /*!< AD conversion result of c-phase zero-current *4 R/W*/
  __IO uint32_t IAADC1;            /*!< AD conversion result of a-phase current *4 R/W*/
  __IO uint32_t IBADC1;            /*!< AD conversion result of b-phase current *4 R/W*/
  __IO uint32_t ICADC1;            /*!< AD conversion result of c-phase current *4 R/W*/
  __IO uint32_t VDC1;              /*!< DC supply voltage (voltage [V] / maximum voltage *3 * 2^15) R/W*/
  __IO uint32_t ID1;               /*!< d-axis current (current [A] / maximum current *2 * 2^31) R/W*/
  __IO uint32_t IQ1;               /*!< q-axis current (current [A] / maximum current *2 * 2^31) R/W*/
       uint32_t RESERVED3;
  __IO uint32_t TADC;              /*!< Common ADC conversion time (based on PWM clock) R */
  __IO uint32_t VCMPU0;            /*!< PMD control: CMPU setting R/W                */
  __IO uint32_t VCMPV0;            /*!< PMD control: CMPV setting R/W                */
  __IO uint32_t VCMPW0;            /*!< PMD control: CMPW setting R/W                */
  __IO uint32_t OUTCR0;            /*!< PMD control: Output control (MDOUT) R/W      */
  __IO uint32_t VTRGCMP00;         /*!< PMD control: TRGCMP0 setting R/W             */
  __IO uint32_t VTRGCMP10;         /*!< PMD control: TRGCMP1 setting R/W             */
  __IO uint32_t VTRGSEL0;          /*!< PMD control: Trigger selection R/W           */
  __IO uint32_t EMGRS0;            /*!< PMD control: EMG return (EMGCR[EMGRS]) W     */
  __IO uint32_t VCMPU1;            /*!< PMD control: CMPU setting R/W                */
  __IO uint32_t VCMPV1;            /*!< PMD control: CMPV setting R/W                */
  __IO uint32_t VCMPW1;            /*!< PMD control: CMPW setting R/W                */
  __IO uint32_t OUTCR1;            /*!< PMD control: Output control (MDOUT) R/W      */
  __IO uint32_t VTRGCMP01;         /*!< PMD control: TRGCMP0 setting R/W             */
  __IO uint32_t VTRGCMP11;         /*!< PMD control: TRGCMP1 setting R/W             */
  __IO uint32_t VTRGSEL1;          /*!< PMD control: Trigger selection R/W           */
  __IO uint32_t EMGRS1;            /*!< PMD control: EMG return (EMGCR[EMGRS]) W     */
} TSB_VE_TypeDef;

/**
  * @brief 16-bit Multi-Purpose Timer (MPT-PMD)
  */
typedef struct
{
  __IO uint32_t MDEN;              /*!< PMD Enable Register                          */
  __IO uint32_t PORTMD;            /*!< Port Output Mode Register                    */
  __IO uint32_t MDCR;              /*!< PMD Control Register                         */
  __I  uint32_t CNTSTA;            /*!< PWM Counter Status Register                  */
  __I  uint32_t MDCNT;             /*!< PWM Counter Register                         */
  __IO uint32_t MDPRD;             /*!< PWM Period Register                          */
  __IO uint32_t CMPU;              /*!< PWM Compare Register                         */
  __IO uint32_t CMPV;              /*!< PWM Compare Register                         */
  __IO uint32_t CMPW;              /*!< PWM Compare Register                         */
  __IO uint32_t MODESEL;           /*!< PWM Mode Select Register                     */
  __IO uint32_t MDOUT;             /*!< PMD Output Control Register                  */
  __IO uint32_t MDPOT;             /*!< PMD Output Setting Register                  */
  __IO uint32_t EMGREL;            /*!< EMG Release Register                         */
  __IO uint32_t EMGCR;             /*!< EMG Control Register                         */
  __I  uint32_t EMGSTA;            /*!< EMG Status Register                          */
  __IO uint32_t OVVCR;             /*!< OVV Control Register                         */
  __I  uint32_t OVVSTA;            /*!< OVV Status Register                          */
  __IO uint32_t DTR;               /*!< Dead Time Register                           */
  __IO uint32_t TRGCMP0;           /*!< Trigger Compare Register 0                   */
  __IO uint32_t TRGCMP1;           /*!< Trigger Compare Register 1                   */
  __IO uint32_t TRGCMP2;           /*!< Trigger Compare Register 2                   */
  __IO uint32_t TRGCMP3;           /*!< Trigger Compare Register 3                   */
  __IO uint32_t TRGCR;             /*!< Trigger Control Register                     */
  __IO uint32_t TRGMD;             /*!< Trigger Output Mode Setting Register         */
  __IO uint32_t TRGSEL;            /*!< Trigger Output Select Register               */
  __IO uint32_t TRGSYNCR;          /*!< TriggerReflashSetting Register               */
} TSB_PMD_TypeDef;

/**
  * @brief DigitalNoizeFilterClockControl
  */
typedef struct
{
  __IO uint32_t CKCR;              /*!< Clcok Control                                */
  __IO uint32_t ENCR;              /*!< EnableControl                                */
} TSB_NF_TypeDef;

/**
  * @brief Flash Control (FC)
  */
typedef struct
{
  __IO uint32_t SECBIT;            /*!< FC Security Bit Register                     */
       uint32_t RESERVED0[6];
union {
  __IO uint32_t FLCR;              /*!< Flash Interface Control Register             */
  __I  uint32_t FLCS;              /*!< FC Register                                  */
  };
} TSB_FC_TypeDef;


/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)


#define TSB_PB_BASE                (PERI_BASE  + 0x0000040UL)
#define TSB_PE_BASE                (PERI_BASE  + 0x0000100UL)
#define TSB_PF_BASE                (PERI_BASE  + 0x0000140UL)
#define TSB_PG_BASE                (PERI_BASE  + 0x0000180UL)
#define TSB_PJ_BASE                (PERI_BASE  + 0x0000240UL)
#define TSB_PK_BASE                (PERI_BASE  + 0x0000280UL)
#define TSB_PM_BASE                (PERI_BASE  + 0x0000300UL)
#define TSB_TB0_BASE               (PERI_BASE  + 0x0010000UL)
#define TSB_TB4_BASE               (PERI_BASE  + 0x0010100UL)
#define TSB_TB5_BASE               (PERI_BASE  + 0x0010140UL)
#define TSB_TB7_BASE               (PERI_BASE  + 0x00101C0UL)
#define TSB_EN0_BASE               (PERI_BASE  + 0x0010400UL)
#define TSB_SBI_BASE               (PERI_BASE  + 0x0020000UL)
#define TSB_SC0_BASE               (PERI_BASE  + 0x0020080UL)
#define TSB_SC1_BASE               (PERI_BASE  + 0x00200C0UL)
#define TSB_ADB_BASE               (PERI_BASE  + 0x0030200UL)
#define TSB_AMP_BASE               (PERI_BASE  + 0x0030400UL)
#define TSB_WD_BASE                (PERI_BASE  + 0x0040000UL)
#define TSB_CG_BASE                (PERI_BASE  + 0x0040200UL)
#define TSB_TRMOSC_BASE            (PERI_BASE  + 0x0040300UL)
#define TSB_OFD_BASE               (PERI_BASE  + 0x0040800UL)
#define TSB_VD_BASE                (PERI_BASE  + 0x0040900UL)
#define TSB_VE_BASE                (PERI_BASE  + 0x0050000UL)
#define TSB_PMD1_BASE              (PERI_BASE  + 0x0050480UL)
#define TSB_NF_BASE                (PERI_BASE  + 0x0060000UL)
#define TSB_FC_BASE                (PERI_BASE  + 0x1FFF010UL)


